Reports/20191111_210934/Data Driven/SOAP API Test Suite/20191111_210934/requests/main/6.har

{
  "log" : {
    "version" : "1.2",
    "pages" : [ ],
    "entries" : [ {
      "startedDateTime" : "2019-11-11T15:09:46.386Z",
      "request" : {
        "method" : "SOAP",
        "url" : "http://webservices.oorsprong.org/websamples.countryinfo/CountryInfoService.wso?WSDL",
        "httpVersion" : "",
        "cookies" : [ ],
        "headers" : [ ],
        "queryString" : [ {
          "name" : "WSDL",
          "value" : ""
        } ],
        "postData" : {
          "mimeType" : "application/octet-stream",
          "text" : "<Envelope xmlns=\"http://schemas.xmlsoap.org/soap/envelope/\">\n    <Body>\n        <CountryFlag xmlns=\"http://www.oorsprong.org/websamples.countryinfo\">\n            <sCountryISOCode>VN</sCountryISOCode>\n        </CountryFlag>\n    </Body>\n</Envelope>",
          "comment" : ""
        },
        "headersSize" : 0,
        "bodySize" : 0,
        "comment" : ""
      },
      "response" : {
        "status" : 200,
        "statusText" : "",
        "httpVersion" : "",
        "cookies" : [ ],
        "headers" : [ ],
        "content" : {
          "size" : 392,
          "mimeType" : "application/xml",
          "text" : "<?xml version=\"1.0\" encoding=\"utf-8\"?>\r\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\r\n  <soap:Body>\r\n    <m:CountryFlagResponse xmlns:m=\"http://www.oorsprong.org/websamples.countryinfo\">\r\n      <m:CountryFlagResult>http://www.oorsprong.org/WebSamples.CountryInfo/Flags/Vietnam.jpg</m:CountryFlagResult>\r\n    </m:CountryFlagResponse>\r\n  </soap:Body>\r\n</soap:Envelope>",
          "comment" : ""
        },
        "redirectURL" : "",
        "headersSize" : 163,
        "bodySize" : 392,
        "comment" : ""
      },
      "cache" : { },
      "timings" : {
        "comment" : "",
        "ssl" : -1,
        "connect" : 684,
        "send" : 0,
        "receive" : 0,
        "dns" : -1,
        "blocked" : -1,
        "wait" : 0
      },
      "comment" : "",
      "_katalonRequestInformation" : {
        "name" : "6",
        "testObjectId" : "Object Repository/Country API/More Services/Country Flag - Data Driven",
        "harId" : "0fa3e9a9-0aa5-4ea9-aec6-7fe8e829bec1",
        "reportFolder" : null
      },
      "time" : 684
    } ],
    "comment" : ""
  }
}